public class Main2 {
    public static void main(String[] args) {
        System.out.println("\t\t\t Конвертер \"GByte to Mbyte\"\n");
        System.out.println(7 + " GB = " + ( 7 * 1024 ) + " MB \n");

        // масса (кг) / рост2 (m2)


//        ИМТ ( Индекс Массы Тела, кг/м2 ) Таблица категорий:
//        Крайний недостаток веса - менее 16.5
//        Недостаток в весе от 16.5 до 18.4
//        Нормальный вес тела от 18.5 до 24.9
//        Избыточная масса тела от 25 до 30
//        Ожирение (Класс I) от 30.1 до 34.9
//        Ожирение (Класс II - тяжелое) от 35 до 40
//        Ожирение (Класс III - крайне тяжелое) более 40

        System.out.println("\t\t\t*** Калькулятор \"BMI\" *** ");
        System.out.println("BMI: " + 75.0 / (1.80 * 1.80) );
    }
}
